import subprocess



from PIL import Image, ImageDraw, ImageFont

# 字体文件和字符
font_path = './ark-pixel-12px-proportional.ttc'  # 替换为你的字体文件路径

# 图像大小和字体大小
image_size = (11, 10)  # 图像大小//列 行
font_size = 11  # 字体大小


char_num=158
char_sum=['步','\
进','\
频','\
率','\
发','\
射','\
功','\
接','\
收','\
数','\
字','\
亚','\
音','\
模','\
拟','\
送','\
差','\
方','\
向','\
宽','\
窄','\
带','\
配','\
置','\
加','\
密','\
通','\
话','\
遇','\
忙','\
禁','\
压','\
扩','\
调','\
制','\
式','\
搜','\
索','\
列','\
表','\
存','\
储','\
信','\
道','\
删','\
除','\
命','\
名','\
扫','\
描','\
恢','\
复','\
短','\
按','\
侧','\
键','\
长','\
盘','\
自','\
动','\
锁','\
定','\
超','\
时','\
省','\
电','\
麦','\
克','\
风','\
增','\
益','\
显','\
示','\
条','\
开','\
机','\
息','\
池','\
背','\
光','\
最','\
小','\
亮','\
度','\
大','\
启','\
结','\
束','\
尾','\
消','\
过','\
中','\
继','\
一','\
即','\
呼','\
身','\
份','\
码','\
上','\
线','\
下','\
响','\
应','\
位','\
预','\
载','\
波','\
解','\
联','\
系','\
人','\
声','\
控','\
静','\
噪','\
等','\
级','\
特','\
地','\
区','\
段','\
关','\
参','\
低','\
高','\
偏','\
移','\
闭','\
主','\
双','\
二','\
号','\
后','\
失','\
停','\
止','\
称','\
不','\
本','\
铃','\
回','\
全','\
部','\
蛙','\
叫','\
所','\
有','\
用','\
比','\
例','\
手','\
筒','\
设','\
监','\
听','\
切','\
换'
]
for i in range(char_num):
    character = char_sum[i]
    out_path="./image/"+character+".png"
    # 创建图像
    image = Image.new('1', image_size, color=1)  # '1'表示二值图像，初始为白色

    # 加载字体
    font = ImageFont.truetype(font_path, font_size)

    # 设置字符在画布上的位置
    x_pos = 0  # 横坐标位置
    y_pos = -4  # 纵坐标位置

    # 在图像上绘制字符
    draw = ImageDraw.Draw(image)
    draw.text((x_pos, y_pos), character, font=font, fill=0)  # fill=0 表示黑色

    # 显示图像或保存图像
    image.save(out_path, format="PNG")


    # 执行代码
    path_name = out_path

    # 在b.py中运行，传递路径名作为参数
    subprocess.run(["python", "pic.py", path_name])


